CSI API ETABS v1
cAreaObj.GetDesignOrientation Method
 Retrieves the design orientation of an area object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDesignOrientation(
	string Name,
	ref eAreaDesignOrientation DesignOrientation
)
Function GetDesignOrientation (
	Name As String,
	ByRef DesignOrientation As eAreaDesignOrientation
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim DesignOrientation As eAreaDesignOrientation
Dim returnValue As Integer
returnValue = instance.GetDesignOrientation(Name,
	DesignOrientation)
int GetDesignOrientation(
	String^ Name,
	eAreaDesignOrientation% DesignOrientation
)
abstract GetDesignOrientation :
        Name : string *
        DesignOrientation : eAreaDesignOrientation byref -> int
Parameters
Name
Type: System.String
 The name of a defined area object.
DesignOrientation
Type: ETABSv1.eAreaDesignOrientation
 This is one of the items in the eAreaDesignOrientation enumeration.
Return Value
Type: Int32
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim DesignOrientation As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get area property
   ret = SapModel.AreaObj.GetDesignOrientation("1", DesignOrientation)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace